silictech-org/edgetx/radio/src/targets/stm32h750/tp_gt911.cpp
 bool I2C_GT911_SendConfig(uint8_t cfgVer)
 {
   uint8_t buf[2] = { cfgVer, 1 };
   bool bResult = true;
 
   for (uint8_t i = 1; i < sizeof(TOUCH_GT911_Cfg); i++) {
     buf[0] += TOUCH_GT911_Cfg[i]; //check sum
   }
   
   buf[0] = (~buf[0]) + 1;
 
   if (!I2C_GT911_WriteRegister(GT911_CONFIG_REG, (uint8_t *)&cfgVer, 1)) {
     test_uart_printf("GT911 ERROR: write config failed\n");
     bResult = false;
   }
 
   if (!I2C_GT911_WriteRegister(GT911_CONFIG_REG+1, (uint8_t *)&TOUCH_GT911_Cfg[1],
                                sizeof(TOUCH_GT911_Cfg)-1)) {
     test_uart_printf("GT911 ERROR: write config failed\n");
     bResult = false;
   }
 
   // write checksum and config_fresh
   if (!I2C_GT911_WriteRegister(GT911_CONFIG_CHECKSUM_REG, buf, 2)) {
     test_uart_printf("GT911 ERROR: write config checksum failed\n");
     bResult = false;
   }
 
   return bResult;
 }
 
 void touchPanelDeInit(void)
 {
   gpio_int_disable(TOUCH_INT_GPIO);
   touchGT911Flag = false;
 }
 
 uint8_t tp_gt911_cfgVer = GT911_CFG_NUMBER;
 
 bool touchPanelInit(void)
 {
   uint8_t tmp[4] = {0};
 
   if (touchGT911Flag) {
     gpio_init_int(TOUCH_INT_GPIO, GPIO_IN_PU, GPIO_RISING, _gt911_exti_isr);
     return true;
   } else {
     test_uart_printf("Touchpanel init start ...\n");
 
     gpio_init(TOUCH_RST_GPIO, GPIO_OUT, GPIO_PIN_SPEED_LOW);
     gpio_init(TOUCH_INT_GPIO, GPIO_OUT, GPIO_PIN_SPEED_LOW);
     I2C_Init_Radio();
 
     gpio_clear(TOUCH_RST_GPIO);
     gpio_set(TOUCH_INT_GPIO);
     delay_us(200);
 
     gpio_set(TOUCH_RST_GPIO);
     delay_ms(6);
 
     gpio_clear(TOUCH_INT_GPIO);
     delay_ms(55);
 
     gpio_init(TOUCH_INT_GPIO, GPIO_IN_PU, GPIO_PIN_SPEED_LOW);
 
     delay_ms(50);
 
     test_uart_printf("Reading Touch registry\n");
     if (!I2C_GT911_ReadRegister(GT911_PRODUCT_ID_REG, tmp, 4)) {
       test_uart_printf("GT911 ERROR: Product ID read failed\n");
     }
 
     if (strcmp((char *)tmp, TP_GT911_ID) == 0) {
       test_uart_printf("GT911 chip detected\n");
       tmp[0] = 0X02;
       if (!I2C_GT911_WriteRegister(GT911_COMMAND_REG, tmp, 1)) {
         test_uart_printf("GT911 ERROR: write to control register failed\n");
       }
       if (!I2C_GT911_ReadRegister(GT911_CONFIG_REG, tmp, 1)) {
         test_uart_printf("GT911 ERROR: configuration register read failed\n");
       }
 
       test_uart_printf("Chip config Ver:%x", tmp[0]);
       if ((tp_gt911_cfgVer == 0) || (tmp[0] < tp_gt911_cfgVer)) { // Config ver
         test_uart_printf("Sending new config %d", GT911_CFG_NUMBER);
         if (!I2C_GT911_SendConfig(tp_gt911_cfgVer)) {
           test_uart_printf("GT911 ERROR: sending configration failed\n");
         }
         if (!I2C_GT911_ReadRegister(GT911_CONFIG_REG, tmp, 1)) {
           test_uart_printf("GT911 ERROR: configuration register read failed\n");
         }
         tp_gt911_cfgVer = tmp[0];
       }
 
       if (!I2C_GT911_ReadRegister(GT911_FIRMWARE_VERSION_REG, tmp, 2)) {
         test_uart_printf("GT911 ERROR: reading firmware version failed\n");
       } else {
         touchGT911fwver = (tmp[1] << 8) + tmp[0];
         test_uart_printf("GT911 FW version: %u", touchGT911fwver);
       }
 
       delay_ms(10);
       tmp[0] = 0X00;
       if (!I2C_GT911_WriteRegister(GT911_COMMAND_REG, tmp, 1)) { // end reset
         test_uart_printf("GT911 ERROR: write to command register failed\n");
       }
       touchGT911Flag = true;
 
       gpio_init_int(TOUCH_INT_GPIO, GPIO_IN_PU, GPIO_RISING, _gt911_exti_isr);
 
       return true;
     }
     test_uart_printf("GT911 chip NOT FOUND\n");
     return false;
   }
 }
 
 bool I2C_ReInit(void)
 {
   test_uart_printf("I2C B1 ReInit\n");
   touchPanelDeInit();
   if (stm32_i2c_deinit(TOUCH_I2C_BUS) < 0)
     test_uart_printf("I2C B1 ReInit - I2C DeInit failed\n");
 
   // If DeInit fails, try to re-init anyway
   if (!touchPanelInit()) {
     test_uart_printf("I2C B1 ReInit - touchPanelInit failed\n");
     return false;
   }
   return true;
 }
 
 #if defined(SIMU) || defined(SEMIHOSTING) || defined(DEBUG)
 static const char *event2str(uint8_t ev)
 {
   switch (ev) {
     case TE_NONE:
       return "NONE";
     case TE_UP:
       return "UP";
     case TE_DOWN:
       return "DOWN";
     case TE_SLIDE_END:
       return "SLIDE_END";
     case TE_SLIDE:
       return "SLIDE";
     default:
       return "UNKNOWN";
   }
 }
 #endif
 
 struct TouchState touchPanelRead()
 {
   uint8_t state = 0;
 
   if (!touchEventOccured) return internalTouchState;
 
   touchEventOccured = false;
 
   uint32_t startReadStatus = RTOS_GET_MS();
   do {
     if (!I2C_GT911_ReadRegister(GT911_READ_XY_REG, &state, 1)) {
       // ledRed();
       touchGT911hiccups++;
       test_uart_printf("GT911 I2C read XY error\n");
       if (!I2C_ReInit()) test_uart_printf("I2C B1 ReInit failed\n");
       return internalTouchState;
     }
 
     if (state & 0x80u) {
       // ready
       break;
     }
     RTOS_WAIT_MS(1);
   } while (RTOS_GET_MS() - startReadStatus < GT911_TIMEOUT);
 
   internalTouchState.deltaX = 0;
   internalTouchState.deltaY = 0;
   test_uart_printf("touch state = 0x%x", state);
   if (state & 0x80u) {
     uint8_t pointsCount = (state & 0x0Fu);
     uint32_t now = RTOS_GET_MS();
     internalTouchState.tapCount = 0;
 
     if (pointsCount > 0 && pointsCount <= GT911_MAX_TP) {
       if (!I2C_GT911_ReadRegister(GT911_READ_XY_REG + 1, touchData.data,
                                   pointsCount * sizeof(TouchPoint))) {
         // ledRed();
         touchGT911hiccups++;
         test_uart_printf("GT911 I2C data read error\n");
         if (!I2C_ReInit()) test_uart_printf("I2C B1 ReInit failed\n");
         return internalTouchState;
       }
         
       if (internalTouchState.event == TE_NONE ||
           internalTouchState.event == TE_UP ||
           internalTouchState.event == TE_SLIDE_END) {
         internalTouchState.event = TE_DOWN;
         internalTouchState.startX = internalTouchState.x =
             touchData.points[0].x;
         internalTouchState.startY = internalTouchState.y =
             touchData.points[0].y;
         downTime = now;
       } else {
         internalTouchState.deltaX =
             touchData.points[0].x - internalTouchState.x;
         internalTouchState.deltaY =
             touchData.points[0].y - internalTouchState.y;
         if (internalTouchState.event == TE_SLIDE ||
             abs(internalTouchState.deltaX) >= SLIDE_RANGE ||
             abs(internalTouchState.deltaY) >= SLIDE_RANGE) {
           internalTouchState.event = TE_SLIDE;
           internalTouchState.x = touchData.points[0].x;
           internalTouchState.y = touchData.points[0].y;
         }
       }
     } else {
       if (internalTouchState.event == TE_SLIDE) {
         internalTouchState.event = TE_SLIDE_END;
       } else if (internalTouchState.event == TE_DOWN) {
         internalTouchState.event = TE_UP;
         if (now - downTime <= GT911_TAP_TIME) {
           if (now - tapTime > GT911_TAP_TIME)
             tapCount = 1;
           else
             tapCount++;
           internalTouchState.tapCount = tapCount;
           tapTime = now;
         }
       } else {
         internalTouchState.event = TE_NONE;
       }
     }
   }
 
   uint8_t zero = 0;
   if (!I2C_GT911_WriteRegister(GT911_READ_XY_REG, &zero, 1)) {
     test_uart_printf("GT911 ERROR: clearing XY register failed\n");
   }
 
  //  test_uart_printf("touch event = %s", event2str(internalTouchState.event));
   return internalTouchState;
 }
 
 bool touchPanelEventOccured()
 {
   return touchEventOccured;
 }
 
 TouchState getInternalTouchState()
 {
   return internalTouchState;
 }
 
 